First/src/DataProcessors/РасчетПремий/РасчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетПремий</name>
  <comment>Расчет премий</comment>
</mdclass:DataProcessor>

First/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <comment>Продажи</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/DataProcessors/РасчетПремий/Forms/Форма/Module.bsl
&НаСервере
Процедура РассчитатьНаСервере()
	
	РезультатРасчета.Очистить();
	ЗапросТоваровИУслуг = Новый Запрос;

	// Перебираем Регистры Накопления: Товары и Продажи в разрезе сотрудников
	ЗапросТоваровИУслуг.Текст = "ВЫБРАТЬ
								|	ТоварыПродажи.Сотрудник КАК Сотрудник,
								|	СУММА(ТоварыПродажи.ПроданоТоваров) КАК ПроданоТоваров,
								|	СУММА(ТоварыПродажи.ПроданоУслуг) КАК ПроданоУслуг,
								|	СУММА(0) КАК Премия
								|ИЗ (
								|	ВЫБРАТЬ
								|		Товары.Сотрудник КАК Сотрудник,
	                            |		Товары.Стоимость КАК ПроданоТоваров,
	                            |		0 КАК ПроданоУслуг
								|	ИЗ
	                            |		РегистрНакопления.Товары КАК Товары
	                            |	ГДЕ
	                            |		Товары.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	                            |	
	                            |	ОБЪЕДИНИТЬ ВСЕ
	                            |	
								|	ВЫБРАТЬ
								|		Продажи.Сотрудник КАК Сотрудник,
	                            |		0 КАК ПроданоТоваров,
	                            |		Продажи.Сумма КАК ПроданоУслуг
								|	ИЗ
	                            |		РегистрНакопления.Продажи КАК Продажи
	                            |	ГДЕ
	                            |		Продажи.Период МЕЖДУ &ПериодНачало И &ПериодКонец
								|	) КАК ТоварыПродажи
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ТоварыПродажи.Сотрудник";
	ЗапросТоваровИУслуг.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	ЗапросТоваровИУслуг.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
	
	Выборка = ЗапросТоваровИУслуг.Выполнить().Выбрать();
	
	// Заполняем результатом запроса ТЗ на форме
	Пока Выборка.Следующий() Цикл
		
        // Рассчитываем премию
		ПремияЗаТовар = Выборка.ПроданоТоваров * (ДляТоваров / 100);
		ПремияЗаУслуги = Выборка.ПроданоУслуг * (ДляУслуг / 100);
		ОбщаяПремия = ПремияЗаТовар + ПремияЗаУслуги;
        // Заполняем
    	СтрокаТЧ = РезультатРасчета.Добавить();
    	ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		СтрокаТЧ.Премия = ОбщаяПремия;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
